// iostream - бібліотека для вводу/виводу на консоль
#include "iostream" // Підключаємо стандартну бібліотеку
// Для роботи проекту трпеба зробити головну функцію
// Головна функція - точка початку роботи програми
// main() - службове слово для головної функції
void main() // void - стандартне слово - неповртає значення
{ // початок блоку main()
	// std - стандартній простір імен
	//cout - console output - вивід на консоль
	// << - оператор виводу на консоль
	// ; - кінець команди
	std::cout << "Hello, World!"; //
} // кінецт блоку main()