#include "iostream"
using namespace std;

void main() // не можна писати за блоком main
{
	// Перехід на новий рядок і кінець потоку
	cout << "Working int, double, bool, char" << endl;
	// змінна - для зберігання інформації у програмі - певного типу
	// тип данних - певний набір - числа, символи, дробові значення, логічні значення ( True, False)
	//a = 12 // Помилка - не вказано тип данних
	// int - ціле число
	// double - число з плаваючою комою ( дробове число)
	// bool - логічне значення ( True, False)
	// char - символ
	int a = 22; // присвоєння значення 22 змінній а, яка є цілим числом ( int )
	cout << " a = " << a << endl;

	// Дробові числа у С++ записуються з крапкою, а не з комою, як у звичайному житті
	double b = 3.14; // присвоєння значення 3.14 змінній b, яка є числом з плаваючою комою ( double )
	cout << " b = " << b << endl;
}