// iostream - бібілотека для вводу/виводу на консоль C++
#include<iostream> // Підключаєм стандартну бібліотеку
#include<Windows.h>
void main() // void - стандартне слово - не повертає значення
{ //Початок блоук коду - main()
	using namespace std;
	//кодування консолі на вивід 65001
	SetConsoleOutputCP(65001); // utf-8
	SetConsoleCP(65001);//Консоль для вводу даних 65001
	cout << "Привіт кодування консолі\n";
	cout << "Скільки Вам років?\n";
	int age; // Оголошення змінної для зберігання віку
	cin >> age; // Вводимо з клавіатури число, яке запишемо у age
	cout << "Вам " << age << " років\n";
} //Кінець блоук коду - main()
