#include <iostream> // Підключаєимо стандартну бібліотеку для вводу-виводу
#include "Windows.h" 

int main() // Головна функція, з якої починається виконання програми
{ // початок головної функції
	using namespace std; // щоб не писати std:: коженого разу
	SetConsoleOutputCP(65001); // встановлюємо кодову сторінку для _виводу_ в консоль на UTF-8
	SetConsoleCP(65001); // встановлюємо кодову сторінку для _вводу_ в консоль на UTF-8
	cout << "----- Це приклад з книги -----\n" << endl;
	cout << "Вивчай С++! Це весело!."; // виводимо повідомлення
	cout << endl; // переходимо на новий рядок
	cout << "Ти про це не пожалієш!" << endl; // виводимо ще одне повідомлення і переходимо на новий рядок

	cout << "Введіть перше число: " << endl;
	int age;
	cin >> age;
	cout << "Введіть друге число: " << endl;
	int age2;
	cin >> age2;

	cout << "х = " << age << " y = " << age2 << endl; // виводимо значення змінних age та age2
	cout << "Сума чисел: " << age + age2 << endl; // Додавання
	cout << "Різниця чисел: " << age - age2 << endl; // Віднімання
	cout << "Різниця чисел: " << age * age2 << endl; // Множення
	cout << "Різниця чисел: " << age / age2 << endl; // Ділення


	return 0; // повертаємо 0, що означає успішне завершення програми
} // кінець головної функції