#include "iostream"
#include "Windows.h"

void main()
{
	using namespace std;
	// 1251 - windows кодування
	SetConsoleOutputCP(65001); // Для виводу інформації кодування UTF-8
	SetConsoleCP(65001); // Для вводу інформації кодування UTF-8
	// \n - перехід на новий рядок

	cout << "Привіт Василь!\n" ;

	// Python if - if умова : 
	// Умова - це вираз, який повертає true або false
	// >, <, >=, <=, ==, != - оператори порівняння
	// Створення змінної
	// тип_данних ІМЯ_ЗМІННОЇ;
	// int - ціле число, bool - істина або хиба, double - дробові числа, char - символ
	
	int age = 23;
	cout << "age = " << age << endl;
	if (age == 23) // Умовний оператор if - перевіряє чи age дорівнює 23
	{ // початок блоку, якщо умова вірна
		cout << "Умова вірна " << age << " == 23\n";
	} // кінець блоку, якщо умова була вірна
}